Repository: igorcferreira/GHActionTrigger
Catalog: Sources/GHActionTrigger/Resources/en.lproj/Localizable.xcstrings
Source language: en
Languages: es, pt

# auth.error.noCredentialsAvailable
source: No GitHub credentials available. Run 'ghaction auth login' to authenticate.
es: No hay credenciales de GitHub disponibles. Ejecute 'ghaction auth login' para autenticarse.
pt: Nenhuma credencial do GitHub disponível. Execute 'ghaction auth login' para autenticar.

# auth.error.providerNotFound
source: Authentication provider '%@' not found.
es: Proveedor de autenticación '%@' no encontrado.
pt: Provedor de autenticação '%@' não encontrado.

# auth.error.noInteractiveProviderAvailable
source: No interactive authentication provider available.
es: No hay proveedor de autenticación interactiva disponible.
pt: Nenhum provedor de autenticação interativa disponível.

# auth.error.interactiveAuthNotSupported
source: Provider '%@' does not support interactive authentication.
es: El proveedor '%@' no admite autenticación interactiva.
pt: O provedor '%@' não suporta autenticação interativa.

# auth.error.tokenExpired
source: GitHub token has expired. Please re-authenticate.
es: El token de GitHub ha expirado. Por favor, vuelva a autenticarse.
pt: O token do GitHub expirou. Por favor, autentique novamente.

# auth.error.invalidToken
source: The provided token is invalid or has been revoked.
es: El token proporcionado no es válido o ha sido revocado.
pt: O token fornecido é inválido ou foi revogado.

# auth.error.emptyToken
source: The token cannot be empty.
es: El token no puede estar vacío.
pt: O token não pode estar vazio.

# auth.error.deviceCodeRequestFailed
source: Failed to request device code from GitHub.
es: Error al solicitar el código de dispositivo de GitHub.
pt: Falha ao solicitar código de dispositivo do GitHub.

# auth.error.deviceCodeExpired
source: Device code expired. Please try again.
es: El código de dispositivo ha expirado. Por favor, inténtelo de nuevo.
pt: Código de dispositivo expirado. Por favor, tente novamente.

# auth.error.accessDenied
source: Access was denied. The user may have declined authorization.
es: Se denegó el acceso. Es posible que el usuario haya rechazado la autorización.
pt: Acesso negado. O usuário pode ter recusado a autorização.

# auth.error.tokenRequestFailed
source: Token request failed: %@
es: Error en la solicitud del token: %@
pt: Falha na solicitação do token: %@

# auth.error.tokenRequestFailedWithDescription
source: Token request failed: %@ - %@
es: Error en la solicitud del token: %@ - %@
pt: Falha na solicitação do token: %@ - %@

# auth.error.invalidTokenResponse
source: Received invalid response from GitHub token endpoint.
es: Se recibió una respuesta no válida del endpoint de token de GitHub.
pt: Resposta inválida recebida do endpoint de token do GitHub.

# auth.error.keychainError
source: Keychain %@ failed with status: %lld
es: Keychain %@ falló con estado: %lld
pt: Keychain %@ falhou com status: %lld

# auth.error.cannotClearEnvironmentCredentials
source: Cannot clear credentials from environment variables.
es: No se pueden borrar las credenciales de las variables de entorno.
pt: Não é possível limpar credenciais de variáveis de ambiente.

# auth.error.networkError
source: Network error: %@
es: Error de red: %@
pt: Erro de rede: %@

# workflow.error.notAuthenticated
source: Not authenticated. Run 'ghaction auth login' or set GITHUB_TOKEN environment variable.
es: No autenticado. Ejecute 'ghaction auth login' o configure la variable de entorno GITHUB_TOKEN.
pt: Não autenticado. Execute 'ghaction auth login' ou defina a variável de ambiente GITHUB_TOKEN.

# workflow.error.workflowNotFound
source: Workflow '%@' not found in repository '%@'.
es: Workflow '%@' no encontrado en el repositorio '%@'.
pt: Workflow '%@' não encontrado no repositório '%@'.

# workflow.error.repositoryNotFound
source: Repository '%@/%@' not found or not accessible.
es: Repositorio '%@/%@' no encontrado o no accesible.
pt: Repositório '%@/%@' não encontrado ou não acessível.

# workflow.error.permissionDenied
source: Permission denied. Ensure your token has 'repo' or 'workflow' scope.
es: Permiso denegado. Asegúrese de que su token tenga el alcance 'repo' o 'workflow'.
pt: Permissão negada. Certifique-se de que seu token tenha escopo 'repo' ou 'workflow'.

# workflow.error.workflowDispatchNotEnabled
source: Workflow '%@' does not have 'workflow_dispatch' trigger enabled.
es: El workflow '%@' no tiene habilitado el disparador 'workflow_dispatch'.
pt: O workflow '%@' não possui o gatilho 'workflow_dispatch' habilitado.

# workflow.error.invalidRef
source: Invalid git reference '%@'. Must be a branch name, tag, or SHA.
es: Referencia git no válida '%@'. Debe ser un nombre de rama, etiqueta o SHA.
pt: Referência git inválida '%@'. Deve ser um nome de branch, tag ou SHA.

# workflow.error.rateLimited
source: API rate limit exceeded.
es: Límite de velocidad de la API excedido.
pt: Limite de taxa da API excedido.

# workflow.error.rateLimitedWithReset
source: API rate limit exceeded. Resets %@.
es: Límite de velocidad de la API excedido. Se restablece en %@.
pt: Limite de taxa da API excedido. Reinicia em %@.

# workflow.error.networkError
source: Network error: %@
es: Error de red: %@
pt: Erro de rede: %@

# workflow.error.httpError
source: HTTP error %lld
es: Error HTTP %lld
pt: Erro HTTP %lld

# workflow.error.httpErrorWithMessage
source: HTTP error %lld: %@
es: Error HTTP %lld: %@
pt: Erro HTTP %lld: %@

# workflow.error.invalidInput
source: Invalid input '%@': %@
es: Entrada no válida '%@': %@
pt: Entrada inválida '%@': %@

# workflow.error.runNotFound
source: Workflow run %lld not found in repository '%@'.
es: Ejecución del workflow %lld no encontrada en el repositorio '%@'.
pt: Execução do workflow %lld não encontrada no repositório '%@'.

# workflow.error.timeout
source: Timed out: %@
es: Tiempo agotado: %@
pt: Tempo esgotado: %@

# workflow.error.runFailed
source: Workflow run %lld failed with conclusion: %@
es: La ejecución del workflow %lld falló con conclusión: %@
pt: Execução do workflow %lld falhou com conclusão: %@
